<html lang="zh-CN">

  <body>
<div id="content-container">
  
  <div class="book">
    <div class="book-body">
      
  <div class="book-inner">
    <div class="book-nav">
      <div class="menu">
  <a href="" class="logo-name">

  </a>

  

        <a href="/book/Python%E5%85%A5%E9%97%A8%E5%88%B0%E7%B2%BE%E9%80%9A/" class="menu-item">Python&#20837;&#38376;&#21040;&#31934;&#36890;</a>


  

        <a href="/book/Java%E6%94%BE%E5%BC%83%E4%B9%8B%E8%B7%AF/" class="menu-item">Java&#25918;&#24323;&#20043;&#36335;</a>


  

        <a href="/book/%E5%89%8D%E7%AB%AF%E5%BC%80%E5%8F%91/" class="menu-item">&#21069;&#31471;&#24320;&#21457;</a>


  

        <a href="/book/Linux%E4%BB%8E%E5%B0%8F%E7%99%BD%E5%88%B0%E5%A4%A7%E7%A5%9E/" class="menu-item">Linux&#20174;&#23567;&#30333;&#21040;&#22823;&#31070;</a>


  


</div>
    </div>
    <div class="book-wrapper">
      <div class="page-left">
        <i class="fa fa-align-justify"/>
      </div>
      <div class="page-inner">
        <div class="book-header">
          <div class="book-title">
            <span class="book-title-left">&#32534;&#31243;&#35821;&#35328;&#20171;&#32461;&#19982;&#20998;&#31867;</span>
            <span class="book-title-right">&#38405;&#35835;&#37327;: 174648</span>
          </div>
          <div class="book-brief">
            
          </div>
        </div>
        <div class="book-content">
          <section class="">
            

    <link rel="stylesheet" href="/static/mdeditor/editormd/css/editormd.preview.css"/>

    <link rel="stylesheet" href="/static/mdeditor/mdeditor-preview-init.css"/>

            <div id="mdeditor_preview_area" class="mdeditor-preview-area">
  <textarea style="display:none;" mdeditor-preview-config="{&quot;htmlDecode&quot;: true, &quot;taskList&quot;: true}"><h2>&#20160;&#20040;&#26159;&#32534;&#31243;&#65311;&#20026;&#20160;&#20040;&#35201;&#32534;&#31243;&#65311;</h2>&#13;
&#13;
<p>&#32534;&#31243; &#26159;&#20010;&#21160;&#35789;&#65292;&#32534;&#31243;==&#20889;&#20195;&#30721;&#65292;&#20889;&#20195;&#30721;&#20026;&#20102;&#20160;&#20040;? &#20026;&#20102;&#35753;&#35745;&#31639;&#26426;&#24178;&#20320;&#24819;&#35201;&#24178;&#30340;&#20107;&#24773;&#65292;&#27604;&#22914;&#65292;&#39532;&#21270;&#33150;&#24819;&#36319;&#21035;&#20154;&#32842;&#22825;&#65292;&#20110;&#26159;&#20889;&#20102;&#20010;&#32842;&#22825;&#36719;&#20214;&#65292;&#36825;&#20010;&#36719;&#20214;&#23601;&#26159;&#19968;&#22534;&#20195;&#30721;&#30340;&#38598;&#21512;&#65292;&#36825;&#20123;&#20195;&#30721;&#26159;&#20160;&#20040;&#65311;&#36825;&#20123;&#20195;&#30721;&#26159;&#35745;&#31639;&#26426;&#33021;&#29702;&#35299;&#30340;&#35821;&#35328;&#12290;</p>&#13;
&#13;
<p>&#37027;&#35745;&#31639;&#33021;&#29702;&#35299;&#30340;&#35821;&#35328;&#26159;&#20160;&#20040;&#21602;&#65311; &#20043;&#21069;&#65292;&#25105;&#20204;&#24050;&#32463;&#20102;&#35299;&#21040;&#65292;&#23427;&#21482;&#33021;&#29702;&#35299;2&#36827;&#21046;&#65292;0101010...&#65292;&#20320;&#24635;&#19981;&#33021;&#20154;&#32905;&#36755;&#19968;&#22534;&#20108;&#36827;&#21046;&#32473;&#35745;&#31639;&#26426;(&#34429;&#28982;&#26368;&#21407;&#22987;&#30340;&#35745;&#31639;&#26426;&#23601;&#26159;&#36825;&#20040;&#24178;&#30340;)&#35753;&#23427;&#24037;&#20316;&#21543;&#65292;&#36825;&#26679;&#24320;&#21457;&#36895;&#24230;&#22826;&#24930;&#20102;&#12290;&#25152;&#20197;&#26368;&#22909;&#30340;&#21150;&#27861;&#23601;&#26159;&#20154;&#36755;&#20837;&#31616;&#21333;&#30340;&#25351;&#20196;&#65292;&#35745;&#31639;&#26426;&#33021;&#25226;&#25351;&#20196;&#36716;&#25104;&#20108;&#36827;&#21046;&#36827;&#34892;&#25191;&#34892;&#65292;&#20030;&#20363;&#22914;&#19979;:</p>&#13;
&#13;
<p>&#20551;&#22914; &#31243;&#24207;&#21592;&#24819;&#35753;&#35745;&#31639;&#26426; &#25773;&#25918;&#19968;&#39318; &#27468;&#26354; &#65292; &#21482;&#38656;&#35201;&#36755;&#20837;&#25351;&#20196; &#65292;</p>&#13;
&#13;
<pre>&#13;
<code>open "&#32769;&#30007;&#23401;.mp3"&#13;
play</code></pre>&#13;
&#13;
<p>&#35745;&#31639;&#26426;&#30340;CPU&#25509;&#25910;&#21040;&#36825;&#26679;&#30340;&#25351;&#20196;&#21518;&#65292;&#20250;&#25226;&#23427;&#36716;&#25104;&#19968;&#22534; &#21482;&#26377;cpu&#21487;&#20197;&#29702;&#35299;&#30340;&#25351;&#20196;&#65292;&#28982;&#21518;&#20877;&#23558;&#25351;&#20196;&#21464;&#25104;&#21508;&#31181;&#23545;&#24212;&#30340;&#22914;&#19979;&#31867;&#20284;&#20108;&#36827;&#21046;</p>&#13;
&#13;
<pre>&#13;
<code>[  op  |  rs |  rt | address/immediate]&#13;
   35     3     8           68           decimal&#13;
 100011 00011 01000 00000 00001 000100   binary</code></pre>&#13;
&#13;
<p>&#26368;&#32456;cpu &#21435;&#35843;&#29992;&#20320;&#30340;&#30828;&#30424;&#19978;&#36825;&#39318;&#27468;&#65292;&#36890;&#36807;&#38899;&#31665;&#25773;&#25918;&#12290;</p>&#13;
&#13;
<p>&#19978;&#38754;cpu&#37027;&#27573;&#25351;&#20196;&#22826;&#38590;&#29702;&#35299;&#20102;&#65292;&#22914;&#26524;&#35753;&#20320;&#22825;&#22825;&#20889;&#36825;&#26679;&#30340;&#20195;&#30721;&#65292;&#22823;&#23478;&#38750;&#24471;&#33258;&#26432;&#19981;&#21487;&#12290;&#36824;&#22909;&#65292;&#20255;&#22823;&#30340;&#35745;&#31639;&#26426;&#20808;&#39537;&#20204;&#65292;&#24320;&#21457;&#20102;&#21508;&#31181;&#32534;&#31243;&#35821;&#35328;&#65292;&#35753;&#25105;&#20204;&#21482;&#38656;&#35201;&#36890;&#36807;&#20889;&#19968;&#20123;&#31616;&#21333;&#30340;&#35268;&#21017;&#65292;&#23601;&#33021;&#25805;&#20316;&#35745;&#31639;&#26426;&#24037;&#20316;&#21862;&#12290;</p>&#13;
&#13;
<p><embed height="0" type="application/thunder_download_plugin" width="0"/></p>&#13;
&#13;
<h2>&#26377;&#21738;&#20123;&#32534;&#31243;&#35821;&#35328;&#65311;</h2>&#13;
&#13;
<p>&#32534;&#31243;&#35821;&#35328;&#24635;&#20307;&#20998;&#20197;&#20026;&#26426;&#22120;&#35821;&#35328;&#12289;&#27719;&#32534;&#35821;&#35328;&#12289;&#39640;&#32423;&#35821;&#35328;&#65292;&#22914;&#19979;</p>&#13;
&#13;
<p><strong>&#26426;&#22120;&#35821;&#35328;</strong></p>&#13;
&#13;
<p>&#30001;&#20110;&#35745;&#31639;&#26426;&#20869;&#37096;&#21482;&#33021;&#25509;&#21463;&#20108;&#36827;&#21046;&#20195;&#30721;&#65292;&#22240;&#27492;&#65292;&#29992;&#20108;&#36827;&#21046;&#20195;&#30721;0&#21644;1&#25551;&#36848;&#30340;&#25351;&#20196;&#31216;&#20026;&#26426;&#22120;&#25351;&#20196;&#65292;&#20840;&#37096;&#26426;&#22120;&#25351;&#20196;&#30340;&#38598;&#21512;&#26500;&#25104;&#35745;&#31639;&#26426;&#30340;&#26426;&#22120;&#35821;&#35328;&#65292;&#29992;&#26426;&#22120;&#35821;&#35328;&#32534;&#31243;&#30340;&#31243;&#24207;&#31216;&#20026;&#30446;&#26631;&#31243;&#24207;&#12290;&#21482;&#26377;&#30446;&#26631;&#31243;&#24207;&#25165;&#33021;&#34987;&#35745;&#31639;&#26426;&#30452;&#25509;&#35782;&#21035;&#21644;&#25191;&#34892;&#12290;&#20294;&#26159;&#26426;&#22120;&#35821;&#35328;&#32534;&#20889;&#30340;&#31243;&#24207;&#26080;&#26126;&#26174;&#29305;&#24449;&#65292;&#38590;&#20197;&#35760;&#24518;&#65292;&#19981;&#20415;&#38405;&#35835;&#21644;&#20070;&#20889;&#65292;&#19988;&#20381;&#36182;&#20110;&#20855;&#20307;&#26426;&#31181;&#65292;&#23616;&#38480;&#24615;&#24456;&#22823;&#65292;&#26426;&#22120;&#35821;&#35328;&#23646;&#20110;&#20302;&#32423;&#35821;&#35328;&#12290;</p>&#13;
&#13;
<p>&#29992;&#26426;&#22120;&#35821;&#35328;&#32534;&#20889;&#31243;&#24207;&#65292;&#32534;&#31243;&#20154;&#21592;&#35201;&#39318;&#20808;&#29087;&#35760;&#25152;&#29992;&#35745;&#31639;&#26426;&#30340;&#20840;&#37096;&#25351;&#20196;&#20195;&#30721;&#21644;&#20195;&#30721;&#30340;&#28085;&#20041;&#12290;&#25163;&#32534;&#31243;&#24207;&#26102;&#65292;&#31243;&#24207;&#21592;&#24471;&#33258;&#24049;&#22788;&#29702;&#27599;&#26465;&#25351;&#20196;&#21644;&#27599;&#19968;&#25968;&#25454;&#30340;&#23384;&#20648;&#20998;&#37197;&#21644;&#36755;&#20837;&#36755;&#20986;&#65292;&#36824;&#24471;&#35760;&#20303;&#32534;&#31243;&#36807;&#31243;&#20013;&#27599;&#27493;&#25152;&#20351;&#29992;&#30340;&#24037;&#20316;&#21333;&#20803;&#22788;&#22312;&#20309;&#31181;&#29366;&#24577;&#12290;&#36825;&#26159;&#19968;&#20214;&#21313;&#20998;&#32321;&#29712;&#30340;&#24037;&#20316;&#12290;&#32534;&#20889;&#31243;&#24207;&#33457;&#36153;&#30340;&#26102;&#38388;&#24448;&#24448;&#26159;&#23454;&#38469;&#36816;&#34892;&#26102;&#38388;&#30340;&#20960;&#21313;&#20493;&#25110;&#20960;&#30334;&#20493;&#12290;&#32780;&#19988;&#65292;&#32534;&#20986;&#30340;&#31243;&#24207;&#20840;&#26159;&#20123;0&#21644;1&#30340;&#25351;&#20196;&#20195;&#30721;&#65292;&#30452;&#35266;&#24615;&#24046;&#65292;&#36824;&#23481;&#26131;&#20986;&#38169;&#12290;<strong>&#38500;&#20102;&#35745;&#31639;&#26426;&#29983;&#20135;&#21378;&#23478;&#30340;&#19987;&#19994;&#20154;&#21592;&#22806;&#65292;&#32477;&#22823;&#22810;&#25968;&#30340;&#31243;&#24207;&#21592;&#24050;&#32463;&#19981;&#20877;&#21435;&#23398;&#20064;&#26426;&#22120;&#35821;&#35328;&#20102;&#12290;</strong></p>&#13;
&#13;
<p>&#26426;&#22120;&#35821;&#35328;&#26159;&#24494;&#22788;&#29702;&#22120;&#29702;&#35299;&#21644;&#20351;&#29992;&#30340;&#65292;&#29992;&#20110;&#25511;&#21046;&#23427;&#30340;&#25805;&#20316;&#20108;&#36827;&#21046;&#20195;&#30721;&#12290;</p>&#13;
&#13;
<p>&#23613;&#31649;&#26426;&#22120;&#35821;&#35328;&#22909;&#20687;&#26159;&#24456;&#22797;&#26434;&#30340;&#65292;&#28982;&#32780;&#23427;&#26159;&#26377;&#35268;&#24459;&#30340;&#12290;</p>&#13;
&#13;
<p>&#23384;&#22312;&#30528;&#22810;&#33267;100000&#31181;&#26426;&#22120;&#35821;&#35328;&#30340;&#25351;&#20196;&#12290;&#36825;&#24847;&#21619;&#30528;&#19981;&#33021;&#25226;&#36825;&#20123;&#31181;&#31867;&#20840;&#37096;&#21015;&#20986;&#26469;&#12290;</p>&#13;
&#13;
<p>&#20197;&#19979;&#26159;&#19968;&#20123;&#31034;&#20363;&#65306;</p>&#13;
&#13;
<p>&#25351;&#20196;&#37096;&#20221;&#30340;&#31034;&#20363;</p>&#13;
&#13;
<p>0000 &#20195;&#34920; &#21152;&#36733;&#65288;LOAD&#65289;</p>&#13;
&#13;
<p>0001 &#20195;&#34920; &#23384;&#20648;&#65288;STORE&#65289;</p>&#13;
&#13;
<p>...</p>&#13;
&#13;
<p>&#26242;&#23384;&#22120;&#37096;&#20221;&#30340;&#31034;&#20363;</p>&#13;
&#13;
<p>0000 &#20195;&#34920;&#26242;&#23384;&#22120; A</p>&#13;
&#13;
<p>0001 &#20195;&#34920;&#26242;&#23384;&#22120; B</p>&#13;
&#13;
<p>...</p>&#13;
&#13;
<p>&#23384;&#20648;&#22120;&#37096;&#20221;&#30340;&#31034;&#20363;</p>&#13;
&#13;
<p>000000000000 &#20195;&#34920;&#22320;&#22336;&#20026; 0 &#30340;&#23384;&#20648;&#22120;</p>&#13;
&#13;
<p>000000000001 &#20195;&#34920;&#22320;&#22336;&#20026; 1 &#30340;&#23384;&#20648;&#22120;</p>&#13;
&#13;
<p>000000010000 &#20195;&#34920;&#22320;&#22336;&#20026; 16 &#30340;&#23384;&#20648;&#22120;</p>&#13;
&#13;
<p>100000000000 &#20195;&#34920;&#22320;&#22336;&#20026; 2^11 &#30340;&#23384;&#20648;&#22120;</p>&#13;
&#13;
<p>&#38598;&#25104;&#31034;&#20363;</p>&#13;
&#13;
<p>0000,0000,000000010000 &#20195;&#34920; LOAD A, 16</p>&#13;
&#13;
<p>0000,0001,000000000001 &#20195;&#34920; LOAD B, 1</p>&#13;
&#13;
<p>0001,0001,000000010000 &#20195;&#34920; STORE B, 16</p>&#13;
&#13;
<p>0001,0001,000000000001 &#20195;&#34920; STORE B, 1[1]</p>&#13;
&#13;
<p>&#160;</p>&#13;
&#13;
<p><strong>&#27719;&#32534;&#35821;&#35328;</strong></p>&#13;
&#13;
<p>&#27719;&#32534;&#35821;&#35328;&#30340;&#23454;&#36136;&#21644;&#26426;&#22120;&#35821;&#35328;&#26159;&#30456;&#21516;&#30340;&#65292;&#37117;&#26159;&#30452;&#25509;&#23545;&#30828;&#20214;&#25805;&#20316;&#65292;&#21482;&#19981;&#36807;&#25351;&#20196;&#37319;&#29992;&#20102;&#33521;&#25991;&#32553;&#20889;&#30340;&#26631;&#35782;&#31526;&#65292;&#26356;&#23481;&#26131;&#35782;&#21035;&#21644;&#35760;&#24518;&#12290;&#23427;&#21516;&#26679;&#38656;&#35201;&#32534;&#31243;&#32773;&#23558;&#27599;&#19968;&#27493;&#20855;&#20307;&#30340;&#25805;&#20316;&#29992;&#21629;&#20196;&#30340;&#24418;&#24335;&#20889;&#20986;&#26469;&#12290;&#27719;&#32534;&#31243;&#24207;&#30340;&#27599;&#19968;&#21477;&#25351;&#20196;&#21482;&#33021;&#23545;&#24212;&#23454;&#38469;&#25805;&#20316;&#36807;&#31243;&#20013;&#30340;&#19968;&#20010;&#24456;&#32454;&#24494;&#30340;&#21160;&#20316;&#12290;&#20363;&#22914;&#31227;&#21160;&#12289;&#33258;&#22686;&#65292;&#22240;&#27492;&#27719;&#32534;&#28304;&#31243;&#24207;&#19968;&#33324;&#27604;&#36739;&#20887;&#38271;&#12289;&#22797;&#26434;&#12289;&#23481;&#26131;&#20986;&#38169;&#65292;&#32780;&#19988;&#20351;&#29992;&#27719;&#32534;&#35821;&#35328;&#32534;&#31243;&#38656;&#35201;&#26377;&#26356;&#22810;&#30340;&#35745;&#31639;&#26426;&#19987;&#19994;&#30693;&#35782;&#65292;&#20294;&#27719;&#32534;&#35821;&#35328;&#30340;&#20248;&#28857;&#20063;&#26159;&#26174;&#32780;&#26131;&#35265;&#30340;&#65292;&#29992;&#27719;&#32534;&#35821;&#35328;&#25152;&#33021;&#23436;&#25104;&#30340;&#25805;&#20316;&#19981;&#26159;&#19968;&#33324;&#39640;&#32423;&#35821;&#35328;&#25152;&#33021;&#22815;&#23454;&#29616;&#30340;&#65292;&#32780;&#19988;&#28304;&#31243;&#24207;&#32463;&#27719;&#32534;&#29983;&#25104;&#30340;&#21487;&#25191;&#34892;&#25991;&#20214;&#19981;&#20165;&#27604;&#36739;&#23567;&#65292;&#32780;&#19988;&#25191;&#34892;&#36895;&#24230;&#24456;&#24555;&#12290;</p>&#13;
&#13;
<p>&#27719;&#32534;&#30340;hello world&#65292;&#25171;&#21360;&#19968;&#21477;hello world, &#38656;&#35201;&#20889;&#21313;&#22810;&#34892;&#65292;&#20063;&#26159;&#37257;&#20102;&#12290;</p>&#13;
&#13;
<pre>&#13;
<code>; hello.asm &#13;
section .data            ; &#25968;&#25454;&#27573;&#22768;&#26126;&#13;
        msg db "Hello, world!", 0xA     ; &#35201;&#36755;&#20986;&#30340;&#23383;&#31526;&#20018;&#13;
        len equ $ - msg                 ; &#23383;&#20018;&#38271;&#24230;&#13;
section .text            ; &#20195;&#30721;&#27573;&#22768;&#26126;&#13;
global _start            ; &#25351;&#23450;&#20837;&#21475;&#20989;&#25968;&#13;
_start:                  ; &#22312;&#23631;&#24149;&#19978;&#26174;&#31034;&#19968;&#20010;&#23383;&#31526;&#20018;&#13;
        mov edx, len     ; &#21442;&#25968;&#19977;&#65306;&#23383;&#31526;&#20018;&#38271;&#24230;&#13;
        mov ecx, msg     ; &#21442;&#25968;&#20108;&#65306;&#35201;&#26174;&#31034;&#30340;&#23383;&#31526;&#20018;&#13;
        mov ebx, 1       ; &#21442;&#25968;&#19968;&#65306;&#25991;&#20214;&#25551;&#36848;&#31526;(stdout) &#13;
        mov eax, 4       ; &#31995;&#32479;&#35843;&#29992;&#21495;(sys_write) &#13;
        int 0x80         ; &#35843;&#29992;&#20869;&#26680;&#21151;&#33021;&#13;
                         ; &#36864;&#20986;&#31243;&#24207;&#13;
        mov ebx, 0       ; &#21442;&#25968;&#19968;&#65306;&#36864;&#20986;&#20195;&#30721;&#13;
        mov eax, 1       ; &#31995;&#32479;&#35843;&#29992;&#21495;(sys_exit) &#13;
        int 0x80         ; &#35843;&#29992;&#20869;&#26680;&#21151;&#33021;</code></pre>&#13;
&#13;
<p><strong>&#39640;&#32423;&#35821;&#35328;</strong></p>&#13;
&#13;
<p>&#39640;&#32423;&#35821;&#35328;&#26159;&#22823;&#22810;&#25968;&#32534;&#31243;&#32773;&#30340;&#36873;&#25321;&#12290;&#21644;&#27719;&#32534;&#35821;&#35328;&#30456;&#27604;&#65292;&#23427;&#19981;&#20294;&#23558;&#35768;&#22810;&#30456;&#20851;&#30340;&#26426;&#22120;&#25351;&#20196;&#21512;&#25104;&#20026;&#21333;&#26465;&#25351;&#20196;&#65292;&#24182;&#19988;&#21435;&#25481;&#20102;&#19982;&#20855;&#20307;&#25805;&#20316;&#26377;&#20851;&#20294;&#19982;&#23436;&#25104;&#24037;&#20316;&#26080;&#20851;&#30340;&#32454;&#33410;&#65292;&#20363;&#22914;&#20351;&#29992;&#22534;&#26632;&#12289;&#23492;&#23384;&#22120;&#31561;&#65292;&#36825;&#26679;&#23601;&#22823;&#22823;&#31616;&#21270;&#20102;&#31243;&#24207;&#20013;&#30340;&#25351;&#20196;&#12290;&#21516;&#26102;&#65292;&#30001;&#20110;&#30465;&#30053;&#20102;&#24456;&#22810;&#32454;&#33410;&#65292;&#32534;&#31243;&#32773;&#20063;&#23601;&#19981;&#38656;&#35201;&#26377;&#22826;&#22810;&#30340;&#19987;&#19994;&#30693;&#35782;&#12290;</p>&#13;
&#13;
<p>&#39640;&#32423;&#35821;&#35328;&#20027;&#35201;&#26159;&#30456;&#23545;&#20110;&#27719;&#32534;&#35821;&#35328;&#32780;&#35328;&#65292;&#23427;&#24182;&#19981;&#26159;&#29305;&#25351;&#26576;&#19968;&#31181;&#20855;&#20307;&#30340;&#35821;&#35328;&#65292;&#32780;&#26159;&#21253;&#25324;&#20102;&#24456;&#22810;&#32534;&#31243;&#35821;&#35328;&#65292;&#20687;&#26368;&#31616;&#21333;&#30340;&#32534;&#31243;&#35821;&#35328;PASCAL&#35821;&#35328;&#20063;&#23646;&#20110;&#39640;&#32423;&#35821;&#35328;&#12290;</p>&#13;
&#13;
<p><strong>&#39640;&#32423;&#35821;&#35328;&#25152;&#32534;&#21046;&#30340;&#31243;&#24207;&#19981;&#33021;&#30452;&#25509;&#34987;&#35745;&#31639;&#26426;&#35782;&#21035;&#65292;&#24517;&#39035;&#32463;&#36807;&#36716;&#25442;&#25165;&#33021;&#34987;&#25191;&#34892;</strong>&#65292;&#25353;&#36716;&#25442;&#26041;&#24335;&#21487;&#23558;&#23427;&#20204;&#20998;&#20026;&#20004;&#31867;&#65306;</p>&#13;
&#13;
<p><strong>&#32534;&#35793;&#31867;</strong>&#65306;&#32534;&#35793;&#26159;&#25351;&#22312;&#24212;&#29992;&#28304;&#31243;&#24207;&#25191;&#34892;&#20043;&#21069;&#65292;&#23601;&#23558;&#31243;&#24207;&#28304;&#20195;&#30721;&#8220;&#32763;&#35793;&#8221;&#25104;&#30446;&#26631;&#20195;&#30721;&#65288;&#26426;&#22120;&#35821;&#35328;&#65289;&#65292;&#22240;&#27492;&#20854;&#30446;&#26631;&#31243;&#24207;&#21487;&#20197;&#33073;&#31163;&#20854;&#35821;&#35328;&#29615;&#22659;&#29420;&#31435;&#25191;&#34892;(&#32534;&#35793;&#21518;&#29983;&#25104;&#30340;&#21487;&#25191;&#34892;&#25991;&#20214;&#65292;&#26159;cpu&#21487;&#20197;&#29702;&#35299;&#30340;2&#36827;&#21046;&#30340;&#26426;&#22120;&#30721;&#32452;&#25104;&#30340;)&#65292;&#20351;&#29992;&#27604;&#36739;&#26041;&#20415;&#12289;&#25928;&#29575;&#36739;&#39640;&#12290;&#20294;&#24212;&#29992;&#31243;&#24207;&#19968;&#26086;&#38656;&#35201;&#20462;&#25913;&#65292;&#24517;&#39035;&#20808;&#20462;&#25913;&#28304;&#20195;&#30721;&#65292;&#20877;&#37325;&#26032;&#32534;&#35793;&#29983;&#25104;&#26032;&#30340;&#30446;&#26631;&#25991;&#20214;&#65288;* .obj&#65292;&#20063;&#23601;&#26159;OBJ&#25991;&#20214;&#65289;&#25165;&#33021;&#25191;&#34892;&#65292;&#21482;&#26377;&#30446;&#26631;&#25991;&#20214;&#32780;&#27809;&#26377;&#28304;&#20195;&#30721;&#65292;&#20462;&#25913;&#24456;&#19981;&#26041;&#20415;&#12290;</p>&#13;
&#13;
<p><img alt="" height="447" src="/media/images/2019/02/20/vs-1.png" width="800"/></p>&#13;
&#13;
<p>&#160;</p>&#13;
&#13;
<p><strong>&#32534;&#35793;&#21518;&#31243;&#24207;&#36816;&#34892;&#26102;&#19981;&#38656;&#35201;&#37325;&#26032;&#32763;&#35793;&#65292;&#30452;&#25509;&#20351;&#29992;&#32534;&#35793;&#30340;&#32467;&#26524;&#23601;&#34892;&#20102;&#12290;&#31243;&#24207;&#25191;&#34892;&#25928;&#29575;&#39640;&#65292;&#20381;&#36182;&#32534;&#35793;&#22120;&#65292;&#36328;&#24179;&#21488;&#24615;&#24046;&#20123;</strong>&#12290;&#22914;C&#12289;C++&#12289;Delphi&#31561;</p>&#13;
&#13;
<p><strong>&#35299;&#37322;&#31867;</strong>&#65306;&#25191;&#34892;&#26041;&#24335;&#31867;&#20284;&#20110;&#25105;&#20204;&#26085;&#24120;&#29983;&#27963;&#20013;&#30340;&#8220;&#21516;&#22768;&#32763;&#35793;&#8221;&#65292;&#24212;&#29992;&#31243;&#24207;&#28304;&#20195;&#30721;&#19968;&#36793;&#30001;&#30456;&#24212;&#35821;&#35328;&#30340;&#35299;&#37322;&#22120;&#8220;&#32763;&#35793;&#8221;&#25104;&#30446;&#26631;&#20195;&#30721;&#65288;&#26426;&#22120;&#35821;&#35328;&#65289;&#65292;&#19968;&#36793;&#25191;&#34892;&#65292;&#22240;&#27492;&#25928;&#29575;&#27604;&#36739;&#20302;&#65292;&#32780;&#19988;&#19981;&#33021;&#29983;&#25104;&#21487;&#29420;&#31435;&#25191;&#34892;&#30340;&#21487;&#25191;&#34892;&#25991;&#20214;&#65292;&#24212;&#29992;&#31243;&#24207;&#19981;&#33021;&#33073;&#31163;&#20854;&#35299;&#37322;&#22120;(&#24819;&#36816;&#34892;&#65292;&#24517;&#39035;&#20808;&#35013;&#19978;&#35299;&#37322;&#22120;&#65292;&#23601;&#20687;&#36319;&#32769;&#22806;&#35828;&#35805;&#65292;&#24517;&#39035;&#26377;&#32763;&#35793;&#22312;&#22330;)&#65292;&#20294;&#36825;&#31181;&#26041;&#24335;&#27604;&#36739;&#28789;&#27963;&#65292;&#21487;&#20197;&#21160;&#24577;&#22320;&#35843;&#25972;&#12289;&#20462;&#25913;&#24212;&#29992;&#31243;&#24207;&#12290;&#22914;Python&#12289;Java&#12289;PHP&#12289;Ruby&#31561;&#35821;&#35328;&#12290;</p>&#13;
&#13;
<p>&#160;</p>&#13;
&#13;
<h3><strong>&#24635;&#32467;</strong></h3>&#13;
&#13;
<p><strong>&#26426;&#22120;&#35821;&#35328;</strong></p>&#13;
&#13;
<p>&#20248;&#28857;&#26159;&#26368;&#24213;&#23618;&#65292;&#36895;&#24230;&#26368;&#24555;&#65292;&#32570;&#28857;&#26159;&#26368;&#22797;&#26434;&#65292;&#24320;&#21457;&#25928;&#29575;&#26368;&#20302;</p>&#13;
&#13;
<p><strong>&#27719;&#32534;&#35821;&#35328;</strong></p>&#13;
&#13;
<p>&#20248;&#28857;&#26159;&#27604;&#36739;&#24213;&#23618;&#65292;&#36895;&#24230;&#26368;&#24555;&#65292;&#32570;&#28857;&#26159;&#22797;&#26434;&#65292;&#24320;&#21457;&#25928;&#29575;&#26368;&#20302;</p>&#13;
&#13;
<p><strong>&#39640;&#32423;&#35821;&#35328;</strong></p>&#13;
&#13;
<p>&#32534;&#35793;&#22411;&#35821;&#35328;&#25191;&#34892;&#36895;&#24230;&#24555;&#65292;&#19981;&#20381;&#36182;&#35821;&#35328;&#29615;&#22659;&#36816;&#34892;&#65292;&#36328;&#24179;&#21488;&#24046;</p>&#13;
&#13;
<p>&#35299;&#37322;&#22411;&#36328;&#24179;&#21488;&#22909;&#65292;&#19968;&#20221;&#20195;&#30721;&#65292;&#21040;&#22788;&#20351;&#29992;&#65292;&#32570;&#28857;&#26159;&#25191;&#34892;&#36895;&#24230;&#24930;&#65292;&#20381;&#36182;&#35299;&#37322;&#22120;&#36816;&#34892;</p>&#13;
&#13;
<p>&#160;</p>&#13;
&#13;
<h2>&#20027;&#27969;&#32534;&#31243;&#35821;&#35328;&#20171;&#32461;(10&#20998;&#38047;)</h2>&#13;
&#13;
<p>&#19990;&#30028;&#19978;&#30340;&#32534;&#31243;&#35821;&#35328;&#26377;600&#22810;&#31181;&#65292;&#20294;&#30495;&#27491;&#22823;&#23478;&#20027;&#27969;&#22312;&#20351;&#29992;&#30340;&#26368;&#22810;&#20108;&#19977;&#21313;&#31181;&#65292;&#19981;&#21516;&#30340;&#35821;&#35328;&#26377;&#33258;&#24049;&#30340;&#29305;&#28857;&#21644;&#25797;&#38271;&#39046;&#22495;&#65292;&#38543;&#30528;&#35745;&#31639;&#26426;&#30340;&#19981;&#26029;&#21457;&#23637;&#65292;&#26032;&#35821;&#35328;&#22312;&#19981;&#26029;&#35806;&#29983;&#65292;&#20063;&#21516;&#26102;&#26377;&#24456;&#22810;&#32769;&#26087;&#30340;&#35821;&#35328;&#24930;&#24930;&#26080;&#20154;&#29992;&#20102;&#12290;&#26377;&#20010;&#26435;&#23041;&#30340;&#35821;&#35328;&#25490;&#21517;&#32593;&#31449;&#65292;&#21487;&#20197;&#30475;&#21040;&#20027;&#27969;&#30340;&#32534;&#31243;&#35821;&#35328;&#26159;&#21738;&#20123;</p>&#13;
&#13;
<p>*2019&#24180;2&#26376;&#25968;&#25454;(<a href="https://www.tiobe.com/tiobe-index/" target="_blank">https://www.tiobe.com/tiobe-index/</a>&#160;)</p>&#13;
&#13;
<p><img alt="" height="644" src="/media/images/2019/02/20/image.png" width="800"/></p>&#13;
&#13;
<p>&#160;</p>&#13;
&#13;
<p><img alt="" height="405" src="/media/images/2019/02/20/long_history_program_ranking.png" width="800"/></p>&#13;
&#13;
<p>&#160;</p>&#13;
&#13;
<p>&#19979;&#38754;&#20171;&#32461;&#19979;&#20960;&#20010;&#20027;&#27969;&#30340;&#32534;&#31243;&#35821;&#35328;&#65306;</p>&#13;
&#13;
<p><strong>C&#35821;&#35328;:</strong></p>&#13;
&#13;
<p>C&#35821;&#35328;&#26159;&#19968;&#31181;&#35745;&#31639;&#26426;&#31243;&#24207;&#35774;&#35745;&#35821;&#35328;&#65292;&#23427;&#26082;&#20855;&#26377;&#39640;&#32423;&#35821;&#35328;&#30340;&#29305;&#28857;&#65292;&#21448;&#20855;&#26377;&#27719;&#32534;&#35821;&#35328;&#30340;&#29305;&#28857;&#12290;&#23427;&#30001;&#32654;&#22269;&#36125;&#23572;&#30740;&#31350;&#25152;&#30340;D.M.Ritchie&#20110;1972&#24180;&#25512;&#20986;&#65292;1978&#24180;&#21518;&#65292;C&#35821;&#35328;&#24050;&#20808;&#21518;&#34987;&#31227;&#26893;&#21040;&#22823;&#12289;&#20013;&#12289;&#23567;&#21450;&#24494;&#22411;&#26426;&#19978;&#65292;&#23427;&#21487;&#20197;&#20316;&#20026;&#24037;&#20316;&#31995;&#32479;&#35774;&#35745;&#35821;&#35328;&#65292;&#32534;&#20889;&#31995;&#32479;&#24212;&#29992;&#31243;&#24207;&#65292;&#20063;&#21487;&#20197;&#20316;&#20026;&#24212;&#29992;&#31243;&#24207;&#35774;&#35745;&#35821;&#35328;&#65292;&#32534;&#20889;&#19981;&#20381;&#36182;&#35745;&#31639;&#26426;&#30828;&#20214;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#23427;&#30340;&#24212;&#29992;&#33539;&#22260;&#24191;&#27867;&#65292;&#20855;&#22791;&#24456;&#24378;&#30340;&#25968;&#25454;&#22788;&#29702;&#33021;&#21147;&#65292;&#19981;&#20165;&#20165;&#26159;&#22312;&#36719;&#20214;&#24320;&#21457;&#19978;&#65292;&#32780;&#19988;&#21508;&#31867;&#31185;&#30740;&#37117;&#38656;&#35201;&#29992;&#21040;C&#35821;&#35328;&#65292;&#36866;&#20110;&#32534;&#20889;&#31995;&#32479;&#36719;&#20214;&#65292;&#19977;&#32500;&#65292;&#20108;&#32500;&#22270;&#24418;&#21644;&#21160;&#30011;&#65292;&#20855;&#20307;&#24212;&#29992;&#27604;&#22914;&#21333;&#29255;&#26426;&#20197;&#21450;&#23884;&#20837;&#24335;&#31995;&#32479;&#24320;&#21457;&#12290;</p>&#13;
&#13;
<p><strong>C++&#65306;</strong></p>&#13;
&#13;
<p>C++&#26159;C&#35821;&#35328;&#30340;&#32487;&#25215;&#30340;&#25193;&#23637;&#65292;&#23427;&#26082;&#21487;&#20197;&#36827;&#34892;C&#35821;&#35328;&#30340;&#36807;&#31243;&#21270;&#31243;&#24207;&#35774;&#35745;&#65292;&#21448;&#21487;&#20197;&#36827;&#34892;&#20197;&#25277;&#35937;&#25968;&#25454;&#31867;&#22411;&#20026;&#29305;&#28857;&#30340;&#22522;&#20110;&#23545;&#35937;&#30340;&#31243;&#24207;&#35774;&#35745;&#65292;&#36824;&#21487;&#20197;&#36827;&#34892;&#20197;&#32487;&#25215;&#21644;&#22810;&#24577;&#20026;&#29305;&#28857;&#30340;&#38754;&#21521;&#23545;&#35937;&#30340;&#31243;&#24207;&#35774;&#35745;&#12290;C++&#25797;&#38271;&#38754;&#21521;&#23545;&#35937;&#31243;&#24207;&#35774;&#35745;&#30340;&#21516;&#26102;&#65292;&#36824;&#21487;&#20197;&#36827;&#34892;&#22522;&#20110;&#36807;&#31243;&#30340;&#31243;&#24207;&#35774;&#35745;&#65292;&#22240;&#32780;C++&#23601;&#36866;&#24212;&#30340;&#38382;&#39064;&#35268;&#27169;&#32780;&#35770;&#65292;&#22823;&#23567;&#30001;&#20043;&#12290;</p>&#13;
&#13;
<p>C++&#19981;&#20165;&#25317;&#26377;&#35745;&#31639;&#26426;&#39640;&#25928;&#36816;&#34892;&#30340;&#23454;&#29992;&#24615;&#29305;&#24449;&#65292;&#21516;&#26102;&#36824;&#33268;&#21147;&#20110;&#25552;&#39640;&#22823;&#35268;&#27169;&#31243;&#24207;&#30340;&#32534;&#31243;&#36136;&#37327;&#19982;&#31243;&#24207;&#35774;&#35745;&#35821;&#35328;&#30340;&#38382;&#39064;&#25551;&#36848;&#33021;&#21147;&#12290;</p>&#13;
&#13;
<p><strong>JAVA:</strong></p>&#13;
&#13;
<p>Java&#26159;&#19968;&#31181;&#21487;&#20197;&#25776;&#20889;&#36328;&#24179;&#21488;&#24212;&#29992;&#36719;&#20214;&#30340;&#38754;&#21521;&#23545;&#35937;&#30340;&#31243;&#24207;&#35774;&#35745;&#35821;&#35328;&#65292;&#26159;&#30001;Sun Microsystems&#20844;&#21496;&#20110;1995&#24180;5&#26376;&#25512;&#20986;&#30340;Java&#31243;&#24207;&#35774;&#35745;&#35821;&#35328;&#21644;Java&#24179;&#21488;&#65288;&#21363;JavaSE, JavaEE, JavaME&#65289;&#30340;&#24635;&#31216;&#12290;Java &#25216;&#26415;&#20855;&#26377;&#21331;&#36234;&#30340;&#36890;&#29992;&#24615;&#12289;&#39640;&#25928;&#24615;&#12289;&#24179;&#21488;&#31227;&#26893;&#24615;&#21644;&#23433;&#20840;&#24615;&#65292;&#24191;&#27867;&#24212;&#29992;&#20110;&#20010;&#20154;PC&#12289;&#25968;&#25454;&#20013;&#24515;&#12289;&#28216;&#25103;&#25511;&#21046;&#21488;&#12289;&#31185;&#23398;&#36229;&#32423;&#35745;&#31639;&#26426;&#12289;&#31227;&#21160;&#30005;&#35805;&#21644;&#20114;&#32852;&#32593;&#65292;&#21516;&#26102;&#25317;&#26377;&#20840;&#29699;&#26368;&#22823;&#30340;&#24320;&#21457;&#32773;&#19987;&#19994;&#31038;&#32676;&#12290;&#22312;&#20840;&#29699;&#20113;&#35745;&#31639;&#21644;&#31227;&#21160;&#20114;&#32852;&#32593;&#30340;&#20135;&#19994;&#29615;&#22659;&#19979;&#65292;Java&#26356;&#20855;&#22791;&#20102;&#26174;&#33879;&#20248;&#21183;&#21644;&#24191;&#38420;&#21069;&#26223;&#12290;</p>&#13;
&#13;
<p><strong>PHP:</strong></p>&#13;
&#13;
<p>PHP&#65288;&#22806;&#25991;&#21517;:PHP: Hypertext Preprocessor&#65292;&#20013;&#25991;&#21517;&#65306;&#8220;&#36229;&#25991;&#26412;&#39044;&#22788;&#29702;&#22120;&#8221;&#65289;&#26159;&#19968;&#31181;&#36890;&#29992;&#24320;&#28304;&#33050;&#26412;&#35821;&#35328;&#12290;&#35821;&#27861;&#21560;&#25910;&#20102;C&#35821;&#35328;&#12289;Java&#21644;Perl&#30340;&#29305;&#28857;&#65292;&#21033;&#20110;&#23398;&#20064;&#65292;&#20351;&#29992;&#24191;&#27867;&#65292;&#20027;&#35201;&#36866;&#29992;&#20110;Web&#24320;&#21457;&#39046;&#22495;</p>&#13;
&#13;
<p><strong>Ruby:</strong></p>&#13;
&#13;
<p>Ruby &#26159;&#24320;&#28304;&#30340;&#65292;&#22312;Web &#19978;&#20813;&#36153;&#25552;&#20379;&#65292;&#20294;&#38656;&#35201;&#19968;&#20010;&#35768;&#21487;&#35777;&#12290;[4]</p>&#13;
&#13;
<p>Ruby &#26159;&#19968;&#31181;&#36890;&#29992;&#30340;&#12289;&#35299;&#37322;&#30340;&#32534;&#31243;&#35821;&#35328;&#12290;</p>&#13;
&#13;
<p>Ruby &#26159;&#19968;&#31181;&#30495;&#27491;&#30340;&#38754;&#21521;&#23545;&#35937;&#32534;&#31243;&#35821;&#35328;&#12290;</p>&#13;
&#13;
<p>Ruby &#26159;&#19968;&#31181;&#31867;&#20284;&#20110; Python &#21644; Perl &#30340;&#26381;&#21153;&#22120;&#31471;&#33050;&#26412;&#35821;&#35328;&#12290;</p>&#13;
&#13;
<p>Ruby &#21487;&#20197;&#29992;&#26469;&#32534;&#20889;&#36890;&#29992;&#32593;&#20851;&#25509;&#21475;&#65288;CGI&#65289;&#33050;&#26412;&#12290;</p>&#13;
&#13;
<p>Ruby &#21487;&#20197;&#34987;&#23884;&#20837;&#21040;&#36229;&#25991;&#26412;&#26631;&#35760;&#35821;&#35328;&#65288;HTML&#65289;&#12290;</p>&#13;
&#13;
<p>Ruby &#35821;&#27861;&#31616;&#21333;&#65292;&#36825;&#20351;&#24471;&#26032;&#30340;&#24320;&#21457;&#20154;&#21592;&#33021;&#22815;&#24555;&#36895;&#36731;&#26494;&#22320;&#23398;&#20064; Ruby</p>&#13;
&#13;
<p><strong>GO:</strong></p>&#13;
&#13;
<p>Go &#26159;&#19968;&#20010;&#24320;&#28304;&#30340;&#32534;&#31243;&#35821;&#35328;&#65292;&#23427;&#33021;&#35753;&#26500;&#36896;&#31616;&#21333;&#12289;&#21487;&#38752;&#19988;&#39640;&#25928;&#30340;&#36719;&#20214;&#21464;&#24471;&#23481;&#26131;&#12290;</p>&#13;
&#13;
<p>Go&#26159;&#20174;2007&#24180;&#26411;&#30001;Robert Griesemer, Rob Pike, Ken Thompson&#20027;&#25345;&#24320;&#21457;&#65292;&#21518;&#26469;&#36824;&#21152;&#20837;&#20102;Ian Lance Taylor, Russ Cox&#31561;&#20154;&#65292;&#24182;&#26368;&#32456;&#20110;2009&#24180;11&#26376;&#24320;&#28304;&#65292;&#22312;2012&#24180;&#26089;&#20123;&#26102;&#20505;&#21457;&#24067;&#20102;Go 1&#31283;&#23450;&#29256;&#26412;&#12290;&#29616;&#22312;Go&#30340;&#24320;&#21457;&#24050;&#32463;&#26159;&#23436;&#20840;&#24320;&#25918;&#30340;&#65292;&#24182;&#19988;&#25317;&#26377;&#19968;&#20010;&#27963;&#36291;&#30340;&#31038;&#21306;&#12290;</p>&#13;
&#13;
<p>&#30001;&#20854;&#25797;&#38271;&#24182;&#21457;&#32534;&#31243;</p>&#13;
&#13;
<p><strong>Python:</strong></p>&#13;
&#13;
<p>Python&#26159;&#19968;&#38376;&#20248;&#31168;&#30340;&#32508;&#21512;&#35821;&#35328;&#65292; Python&#30340;&#23447;&#26088;&#26159;&#31616;&#26126;&#12289;&#20248;&#38597;&#12289;&#24378;&#22823;&#65292;&#22312;&#20154;&#24037;&#26234;&#33021;&#12289;&#20113;&#35745;&#31639;&#12289;&#37329;&#34701;&#20998;&#26512;&#12289;&#22823;&#25968;&#25454;&#24320;&#21457;&#12289;WEB&#24320;&#21457;&#12289;&#33258;&#21160;&#21270;&#36816;&#32500;&#12289;&#27979;&#35797;&#31561;&#26041;&#21521;&#24212;&#29992;&#24191;&#27867;&#65292;&#24050;&#26159;&#20840;&#29699;&#31532;4&#22823;&#26368;&#27969;&#34892;&#30340;&#35821;&#35328;&#12290;</p>&#13;
&#13;
<p><embed height="0" type="application/thunder_download_plugin" width="0"/></p></textarea>
</div>
            

    <script src="/static/mdeditor/editormd/lib/marked.min.js"/>

    <script src="/static/mdeditor/editormd/lib/prettify.min.js"/>

    <script src="/static/mdeditor/editormd/editormd.js"/>

    <script src="/static/mdeditor/mdeditor-preview-init.js"/>

          </section>
        </div>
        <div class="book-page book-page-bottom">
          
<div class="book-page-left">
  
</div>
<div class="book-page-right">
  
    <img src="/static/imgs/right.svg"/>
    <a href="/details/322/" data-path="322">
      <span>Python&#20171;&#32461;&#12289;&#21457;&#23637;&#36235;&#21183;</span>
    </a>
  
</div>
        </div>
      </div>
    </div>
  </div>
  <div class="go-top"/>

    </div>
  </div>

</div>

  <script>
    $(".go-top").click(function () {
      $(".book-inner").animate({scrollTop: 0}, 300);
    });
  </script>

</body>
</html>